/* 
  Localizable.strings (Spanish)
  AMD Power Gadget
*/

"Dashboard" = "Panel de Control";
"Telemetry" = "Telemetría";
"Fan Control" = "Control de Ventiladores";
"Profiles" = "Perfiles";
"Advanced" = "Avanzado";
"Menu Bar" = "Barra de Menús";
"System Info" = "Información de Sistema";
"Desktop Widgets" = "Widgets de Escritorio";

"AMD Power" = "AMD Power";
"Gadget" = "Gadget";

"CPU" = "CPU";
"GPU" = "GPU";
"Freq" = "Frecuencia";
"Average" = "Promedio";
"Avg: %@" = "Prom.: %@";
"Collecting data…" = "Recopilando datos…";

"Low Power Mode (LPM)" = "Modo de Bajo Consumo (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Permite a macOS administrar automáticamente la frecuencia del CPU";
"Forces CPU to lowest frequency for minimum power" = "Fuerza al CPU a la frecuencia más baja para el mínimo consumo";
"Core Performance Boost (CPB)" = "Core Performance Boost (CPB)";
"Update Interval" = "Intervalo de Actualización";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Ajustá la frecuencia de actualización. Menor = más responsivo, mayor = menos uso de CPU.";

"Opciones en Menú Bar" = "Opciones en Barra de Menú";
"Choose which items appear in the menu bar. Changes apply immediately." = "Elegí qué elementos aparecen en la barra de menú. Los cambios se aplican inmediatamente.";
"Customize the visual appearance of the menu bar items." = "Personalizá la apariencia visual de los elementos en la barra de menú.";
"Límite de Temp de Alerta" = "Límite de Temp de Alerta";
"Color de Alerta de Temp" = "Color de Alerta de Temp";
"Color de Flechas" = "Color de Flechas";
"Additional telemetry for the menu bar." = "Telemetría adicional para la barra de menú.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "Los datos del GPU se muestran en las columnas de Temp, Power, Memoria y Ventiladores si se activa.";
"Show GPU VRAM" = "Mostrar VRAM de GPU";
"G:X.XG in Memory column" = "G:X.XG en columna de Memoria";
"Show GPU Fan Speed" = "Mostrar RPM de Ventilador de GPU";
"G:XXXX in Fan column" = "G:XXXX en columna de Ventiladores";

"No fans detected." = "No se detectaron ventiladores.";
"SMC driver not available" = "Controlador SMC no disponible";
"Your SMC chip may not be supported." = "Es posible que tu chip SMC no sea compatible.";
"RPM" = "RPM";
"Throttle" = "Aceleración";
"↩ Reset to Auto" = "↩ Volver a Automático";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Seleccioná un perfil para ajustar el rango de operación del CPU. Se aplica de inmediato.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Editá directamente los registros P-State. Requiere desactivar el control de privilegios del kext por boot-arg o root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Esto escribirá las definiciones de P-State crudas directamente al CPU. ¿Continuar?";
"Disabled — work in progress" = "Desactivado — trabajo en progreso";
"WIP" = "Trabajo en Progreso";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Habilitar en OC: Misc → Security → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Información de placa madre no disponible";

"Vista previa de la Barra de Menús:" = "Vista previa de la Barra de Menú:";
"Ancho estimado: %dpt" = "Ancho estimado: %dpt";
"Restart the app to fully apply width changes." = "Reiniciá la aplicación para aplicar por completo los cambios de ancho.";
"Small (%dpt)" = "Pequeño (%dpt)";
"Medium (%dpt)" = "Medio (%dpt)";
"Large (%dpt)" = "Grande (%dpt)";

"Green" = "Verde";
"Blue" = "Azul";
"Orange" = "Naranja";
"Red" = "Rojo";
"Purple" = "Morado";
"Pink" = "Rosa";
"Teal" = "Turquesa";
"Turquoise" = "Turquesa";

"Verde" = "Verde";
"Azul" = "Azul";
"Naranja" = "Naranja";
"Rojo" = "Rojo";
"Morado" = "Morado";
"Rosa" = "Rosa";
"Turquesa" = "Turquesa";

"Dynamic Colors (Temp Only)" = "Colores Dinámicos (Solo Temp)";
"Temp Alert Color" = "Color de Alerta de Temp";
"Temp Alert Limit" = "Límite de Temp de Alerta";
"Network" = "Red";
"Network Arrows Color" = "Color de Flechas de Red";
"Exit" = "Salir";
"AMD Power Gadget" = "AMD Power Gadget";
"AMD Power Tool" = "AMD Power Tool";
"SMC Fans" = "SMC Fans";

"Fan 1" = "Ventilador 1";
"Fan 2" = "Ventilador 2";
"Fan 3" = "Ventilador 3";
"Fan 4" = "Ventilador 4";
"Fan 5" = "Ventilador 5";
"Fan 6" = "Ventilador 6";
"Fan 7" = "Ventilador 7";
"Fan 8" = "Ventilador 8";

/* Alerts */
"To enable motherboard display:" = "Para habilitar la visualización de la placa madre:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Abrí tu archivo de configuración de OpenCore,\n\nAndá a Misc -> Security -> ExposeSensitiveData,\n\nEstablecé el valor en 0x08 para exponer la información de la placa.";
"Done" = "Listo";
"Invalid Input" = "Entrada Inválida";
"Please type in numbers in hexadecimal." = "Por favor, ingresá números en hexadecimal.";
"Unable to Set PStateDef" = "No se pudo establecer PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "La acción fue denegada porque el usuario actual no tiene suficientes privilegios,\no fue cancelada por el usuario.\n\nEjecutá AMD Power Gadget como usuario root o desactivá el control de privilegios con el boot-arg '-amdpnopchk'\n\nDe lo contrario, hacé clic en 'Once' (Una vez) en el mensaje de advertencia para permitir este cambio.";
"Your changes will not be saved" = "Tus cambios no se guardarán";
"Click apply to save changes before closing this windows." = "Hacé clic en aplicar para guardar los cambios antes de cerrar esta ventana.";
"Cancel" = "Cancelar";
"Close without saving" = "Cerrar sin guardar";
"Invalid File" = "Archivo Inválido";
"The selected file could not be read or is not a valid pstate file." = "El archivo seleccionado no pudo ser leído o no es un archivo pstate válido.";
"OK" = "Aceptar";

/* Dynamic format strings */
"Avg: %.2f Ghz, Max: %.2f Ghz" = "Prom.: %.2f GHz, Máx.: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Picos de la Sesión";
"Reset Peaks" = "Restablecer Picos";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "Control de Ventilador GPU (Zero RPM / Curvas)";
"macOS Hardware Limitation" = "Limitación de Hardware de macOS";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Los ajustes directos de velocidad del ventilador de la GPU por software (como activar/desactivar Zero RPM o definir curvas en macOS) no están soportados por el kernel/driver IOKit de macOS para GPUs AMD. El firmware integrado de la GPU (vBIOS) gestiona los ventiladores.";
"Standard Hackintosh Solution:" = "Solución Estándar para Hackintosh:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "La única forma de modificar este comportamiento (como forzar a los ventiladores a girar a temperaturas más bajas o desactivar Zero RPM) es exportando la vBIOS, creando una Soft PowerPlay Table (SPPT) e inyectándola a través de la sección DeviceProperties en el config.plist de OpenCore.";
"Open SPPT Guide" = "Abrir Guía de SPPT";
"MorePowerTool" = "MorePowerTool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Modo CPPC Activo (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Permite el escalado autónomo de frecuencia por hardware (recomendado)";
"Power Management Mode" = "Modo de Gestión de Energía";
"Energy Preference (EPP)" = "Preferencia de Energía (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Seleccioná un perfil autónomo por hardware. El CPU escalará la frecuencia dinámicamente.";
"Performance" = "Rendimiento";
"Balanced Perf" = "Rendimiento Bal.";
"Balanced Power" = "Ahorro Bal.";
"Power Save" = "Ahorro Energía";
"Active Profile Status" = "Estado del Perfil Activo";
"CPU Speed Profiles (Legacy)" = "Perfiles de Velocidad de CPU (Legado)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Seleccioná un perfil manual de P-State. Las frecuencias se limitarán al paso seleccionado.";
"Mode" = "Modo";
"EPP Profile" = "Perfil EPP";

/* Desktop Widgets */
"Show CPU Widget" = "Mostrar Widget de CPU";
"Show GPU Widget" = "Mostrar Widget de GPU";
"Show RAM Widget" = "Mostrar Widget de Memoria (RAM)";
"Show Disk Widget" = "Mostrar Widget de Disco";
"Show Network Widget" = "Mostrar Widget de Red";
"Show Fan Widget" = "Mostrar Widget de Ventiladores";
"Disable All Widgets" = "Desactivar Todos los Widgets";
"Sort by Rank" = "Ordenar por Ranking";
"Edit Widget Layout" = "Editar Diseño de Widgets";
"Unlock widgets to drag them around the screen" = "Desbloquear widgets para arrastrarlos por la pantalla";
"Widget Options" = "Opciones de Widget";
"Customize the appearance and behavior of your desktop widgets." = "Personalizar la apariencia y el comportamiento de los widgets de escritorio.";
"Auto-Align Active Widgets" = "Alinear Widgets Activos";
"Automatically stack active widgets at a corner" = "Alinear automáticamente los widgets activos en una esquina";
"Alignment Corner" = "Esquina de Alineación";
"Top Right" = "Superior Derecha";
"Top Left" = "Superior Izquierda";
"Bottom Right" = "Inferior Derecha";
"Bottom Left" = "Inferior Izquierda";
"Show Clock Widget" = "Mostrar Widget de Reloj";
"Clock" = "Reloj";
"Stats Table" = "Tabla de Estadísticas";
"Classic Glass" = "Clásico Glass";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Matriz de Núcleos";

"United" = "Combinado";
"Show United Widget" = "Mostrar Widget Combinado";
"Configure Combined Metrics" = "Configurar Métricas Combinadas";
"Include CPU" = "Incluir CPU";
"Include GPU" = "Incluir GPU";
"Include RAM" = "Incluir Memoria (RAM)";
"Include Disk" = "Incluir Disco";
"Include Network" = "Incluir Red";
"Include Fan" = "Incluir Ventiladores";

"Temas & Apariencia" = "Temas & Apariencia";
"Análisis" = "Análisis";

"Select Visual Theme (Instant Application)" = "Seleccionar Tema Visual (Cambio Instantáneo)";
"Custom Theme Creator & Exchange (JSON)" = "Creador e Intercambio de Temas Custom (JSON)";
"Chart Rendering Style" = "Estilo de Renderizado de Gráficas";
"Custom Theme Editor" = "Editor de Tema Personalizado";
"Showing active theme colors. Adjust any color to customize." = "Mostrando los colores actuales del tema activo. Ajustá cualquier color para personalizar.";
"Edit Active Theme" = "Editar Tema Activo";
"Export Theme (JSON)" = "Exportar Tema (JSON)";
"Import Theme (JSON)" = "Importar Tema (JSON)";
"Card Background" = "Fondo Tarjeta";
"Cyan Accent" = "Acento Cian";
"Orange Accent" = "Acento Naranja";
"Green Accent" = "Acento Verde";
"Purple Accent" = "Acento Púrpura";


